app/Models/ModelKasMasuk.php

SELECT `id_kas_masjid`, `tanggal`, `nama`, `ket`, `kas_masuk`, `jenis_kas`
FROM `tbl_kas_masjid`
JOIN `tbl_donatur` ON `tbl_kas_masjid`.`iddonaturmasjid`=`tbl_donatur`.`iddonatur`
---
    public function laporankasmasuk()
    {
        $builder = $this->db->table('tbl_kas_masjid');
        $builder->select('id_kas_masjid, tanggal, nama, ket, kas_masuk, jenis_kas');
        $builder->join('tbl_donatur', 'tbl_kas_masjid.iddonaturmasjid=tbl_donatur.iddonatur');
        return $builder->get();